In [6]:
import pandas as pd
import numpy as np

In [8]:
rast1=np.random.randint(1,20,(4,3))
rast2=np.random.randint(20,40,(4,3))

In [10]:
rast1

array([[ 3, 14,  1],
       [19,  5, 18],
       [ 5, 11,  3],
       [16, 14, 18]])

In [11]:
rast2

array([[32, 20, 39],
       [24, 32, 37],
       [31, 35, 24],
       [35, 30, 21]])

In [14]:
df1=pd.DataFrame(rast1,columns=["sütun1","sütun2","sütun3"])
df2=pd.DataFrame(rast2,columns=["sütun1","sütun2","sütun3"])
df1

   sütun1  sütun2  sütun3
0       3      14       1
1      19       5      18
2       5      11       3
3      16      14      18

In [15]:
df2

   sütun1  sütun2  sütun3
0      32      20      39
1      24      32      37
2      31      35      24
3      35      30      21

In [16]:
# Çalışanlar veri seti
emp = pd.DataFrame({
    'Employee ID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Department ID': [101, 102, 101, 103, 102],
    'Salary (USD)': [60000, 50000, 70000, 48000, 52000]
})
df1

   sütun1  sütun2  sütun3
0       3      14       1
1      19       5      18
2       5      11       3
3      16      14      18

In [17]:
df2

   sütun1  sütun2  sütun3
0      32      20      39
1      24      32      37
2      31      35      24
3      35      30      21

In [21]:
# Departmanlar veri seti
dep = pd.DataFrame({
    'Department ID': [101, 102, 103],
    'Department Name': ['Marketing', 'Sales', 'HR'],
    'Location': ['New York', 'Los Angeles', 'Chicago']
})

In [22]:
emp.colums=["calisan ıd","isim","departman ıd","maas"]
emp

   Employee ID     Name  Department ID  Salary (USD)
0            1    Alice            101         60000
1            2      Bob            102         50000
2            3  Charlie            101         70000
3            4    David            103         48000
4            5      Eve            102         52000

In [23]:
dep.columns=["depatman ıd","departman","konum"]
dep

   depatman ıd  departman        konum
0          101  Marketing     New York
1          102      Sales  Los Angeles
2          103         HR      Chicago

In [29]:
df=pd.concat([emp,dep],ignore_index=True)
df

,Employee ID,Name,Department ID,Salary (USD),depatman ıd,departman,konum
0,1.0,Alice,101.0,60000.0,NaN,NaN,NaN
1,2.0,Bob,102.0,50000.0,NaN,NaN,NaN
2,3.0,Charlie,101.0,70000.0,NaN,NaN,NaN
3,4.0,David,103.0,48000.0,NaN,NaN,NaN
4,5.0,Eve,102.0,52000.0,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,101.0,Marketing,New York
6,NaN,NaN,NaN,NaN,102.0,Sales,Los Angeles
7,NaN,NaN,NaN,NaN,103.0,HR,Chicago